HarishKumarSedu/Atmega328_baremetal/Registers/Exported1.h
#define SMCR_– (*(volatile uint8_t *) 1UL << 4) 
#define SMCR_– (*(volatile uint8_t *) 1UL << 3) 
#define SMCR_– (*(volatile uint8_t *) 1UL << 2) 
#define SMCR_– (*(volatile uint8_t *) 1UL << 1) 
#define SMCR_– (*(volatile uint8_t *) 1UL << 0) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 7) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 6) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 5) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 4) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 3) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 2) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 1) 
#define ACSR_ACBG (*(volatile uint8_t *) 1UL << 0) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 7) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 6) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 5) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 4) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 3) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 2) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 1) 
#define SPDR_nan (*(volatile uint8_t *) 1UL << 0) 
#define SPSR_WCOL (*(volatile uint8_t *) 1UL << 7) 
#define SPSR_WCOL (*(volatile uint8_t *) 1UL << 1) 
#define SPSR_WCOL (*(volatile uint8_t *) 1UL << 0) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 7) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 6) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 5) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 4) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 3) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 2) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 1) 
#define SPCR_SPE (*(volatile uint8_t *) 1UL << 0) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 7) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 6) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 5) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 4) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 3) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 2) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 1) 
#define GPIOR2_nan (*(volatile uint8_t *) 1UL << 0) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 7) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 6) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 5) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 4) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 3) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 2) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 1) 
#define GPIOR1_nan (*(volatile uint8_t *) 1UL << 0) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 7) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 6) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 5) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 4) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 3) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 2) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 1) 
#define OCR0B_nan (*(volatile uint8_t *) 1UL << 0) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 7) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 6) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 5) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 4) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 3) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 2) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 1) 
#define OCR0A_nan (*(volatile uint8_t *) 1UL << 0) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 7) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 6) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 5) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 4) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 3) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 2) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 1) 
#define TCNT0_nan (*(volatile uint8_t *) 1UL << 0) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 7) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 4) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 3) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 2) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 1) 
#define TCCR0B_FOC0B (*(volatile uint8_t *) 1UL << 0) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 7) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 6) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 5) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 2) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 1) 
#define TCCR0A_COM0A0 (*(volatile uint8_t *) 1UL << 0) 
#define GTCCR_– (*(volatile uint8_t *) 1UL << 2) 
#define GTCCR_– (*(volatile uint8_t *) 1UL << 1) 
#define GTCCR_– (*(volatile uint8_t *) 1UL << 0) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 7) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 6) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 5) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 4) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 3) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 2) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 1) 
#define EEARH_nan (*(volatile uint8_t *) 1UL << 0) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 7) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 6) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 5) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 4) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 3) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 2) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 1) 
#define EEARL_nan (*(volatile uint8_t *) 1UL << 0) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 7) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 6) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 5) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 4) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 3) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 2) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 1) 
#define EEDR_nan (*(volatile uint8_t *) 1UL << 0) 
#define EECR_– (*(volatile uint8_t *) 1UL << 6) 
#define EECR_– (*(volatile uint8_t *) 1UL << 5) 
#define EECR_– (*(volatile uint8_t *) 1UL << 4) 
#define EECR_– (*(volatile uint8_t *) 1UL << 3) 
#define EECR_– (*(volatile uint8_t *) 1UL << 2) 
#define EECR_– (*(volatile uint8_t *) 1UL << 1) 
#define EECR_– (*(volatile uint8_t *) 1UL << 0) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 7) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 6) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 5) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 4) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 3) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 2) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 1) 
#define GPIOR0_nan (*(volatile uint8_t *) 1UL << 0) 
#define EIMSK_– (*(volatile uint8_t *) 1UL << 2) 
#define EIMSK_– (*(volatile uint8_t *) 1UL << 1) 
#define EIMSK_– (*(volatile uint8_t *) 1UL << 0) 
#define EIFR_– (*(volatile uint8_t *) 1UL << 2) 
#define EIFR_– (*(volatile uint8_t *) 1UL << 1) 
#define EIFR_– (*(volatile uint8_t *) 1UL << 0) 
#define PCIFR_– (*(volatile uint8_t *) 1UL << 3) 
#define PCIFR_– (*(volatile uint8_t *) 1UL << 2) 
#define PCIFR_– (*(volatile uint8_t *) 1UL << 1) 
#define PCIFR_– (*(volatile uint8_t *) 1UL << 0) 
#define TIFR2_– (*(volatile uint8_t *) 1UL << 3) 
#define TIFR2_– (*(volatile uint8_t *) 1UL << 2) 
#define TIFR2_– (*(volatile uint8_t *) 1UL << 1) 
#define TIFR2_– (*(volatile uint8_t *) 1UL << 0) 
#define TIFR1_– (*(volatile uint8_t *) 1UL << 6) 
#define TIFR1_– (*(volatile uint8_t *) 1UL << 3) 
#define TIFR1_– (*(volatile uint8_t *) 1UL << 2) 
#define TIFR1_– (*(volatile uint8_t *) 1UL << 1) 
#define TIFR1_– (*(volatile uint8_t *) 1UL << 0) 
#define TIFR0_– (*(volatile uint8_t *) 1UL << 3) 
#define TIFR0_– (*(volatile uint8_t *) 1UL << 2) 
#define TIFR0_– (*(volatile uint8_t *) 1UL << 1) 
#define TIFR0_– (*(volatile uint8_t *) 1UL << 0) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 7) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 6) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 5) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 4) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 3) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 2) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 1) 
#define PORTD_PORTD6 (*(volatile uint8_t *) 1UL << 0) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 7) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 6) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 5) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 4) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 3) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 2) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 1) 
#define DDRD_DDD6 (*(volatile uint8_t *) 1UL << 0) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 7) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 6) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 5) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 4) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 3) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 2) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 1) 
#define PIND_PIND6 (*(volatile uint8_t *) 1UL << 0) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 7) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 6) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 5) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 4) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 3) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 2) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 1) 
#define PORTC_PORTC6 (*(volatile uint8_t *) 1UL << 0) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 7) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 6) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 5) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 4) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 3) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 2) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 1) 
#define DDRC_DDC6 (*(volatile uint8_t *) 1UL << 0) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 7) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 6) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 5) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 4) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 3) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 2) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 1) 
#define PINC_PINC6 (*(volatile uint8_t *) 1UL << 0) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 7) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 6) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 5) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 4) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 3) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 2) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 1) 
#define PORTB_PORTB6 (*(volatile uint8_t *) 1UL << 0) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 7) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 6) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 5) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 4) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 3) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 2) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 1) 
#define DDRB_DDB6 (*(volatile uint8_t *) 1UL << 0) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 7) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 6) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 5) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 4) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 3) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 2) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 1) 
#define PINB_PINB6 (*(volatile uint8_t *) 1UL << 0) 
